zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/src/stm32mp1xx_hal_mdma.c
/**
  ******************************************************************************
  * @file    stm32mp1xx_hal_mdma.c
  * @author  MCD Application Team
  * @version V0.3.0
  * @date    9-December-2016
  * @brief   MDMA HAL module driver.
  *
  *         This file provides firmware functions to manage the following
  *         functionalities of the Master Direct Memory Access (MDMA) peripheral:
  *           + Initialization/de-initialization functions
  *           + I/O operation functions
  *           + Peripheral State and errors functions
  *
  *
  @verbatim     
  ==============================================================================      
                        ##### How to use this driver #####
  ============================================================================== 
  [..]
   (#) Enable and configure the peripheral to be connected to the MDMA Channel
       (except for internal SRAM/FLASH memories: no initialization is 
       necessary) please refer to Reference manual for connection between peripherals
       and MDMA requests. 
          
   (#) 
       (+) For a given Channel use HAL_MDMA_Init function to program the required configuration through the following parameters:   
           HW request (if any), channel priority, data endianness, request, Source increment,
           destination increment , source data size, destination data size, data alignment, source Burst,
           destination Burst , buffer Transfer Length, Transfer Trigger Mode (buffer transfer, block transfer, repeated block transfer 
           or full transfer) source and destination block address offset, mask address and data.
       
       (+) If using the MDMA in linked list mode then use function HAL_MDMA_CreateLinkedListNode to fill a transfer node.
           Parameters given to the function HAL_MDMA_Init corresponds always to the node zero.
           Use function HAL_MDMA_ConnectLinkedListNode connect the created node to the linked list at a given position.
           User can make a circular linked list by connecting the first node at the end of the list (i.e after the last node)
           In this case the linked list will loop on node 1 : first node connected after the initial transfer defined by the HAL_MDMA_Init
           note the initial transfer itself (node 0).
           Function HAL_MDMA_DisConnectLinkedListNode can be used to remove (disconnect) a node from the transfer linked list.
           When a linked list is circular (last node connected to first one), if removing node1  (node where the linked list loops), 
           the linked list remains circular and node 2 becomes the first one.
           If the linked list is made circular the transfer will loop infinitely (or until aborted by the user).


       (+) User can select the transfer trigger mode (parameter TransferTriggerMode) to define the amount of data to be
           transfer upon a request :
             + MDMA_BUFFER_TRANSFER : each request triggers a transfer of BufferTransferLength data 
               with BufferTransferLength defined within the HAL_MDMA_Init.
             + MDMA_BLOCK_TRANSFER : each request triggers a transfer of a block 
               with block size defined within the function HAL_MDMA_Start/HAL_MDMA_Start_IT.
             + MDMA_REPEAT_BLOCK_TRANSFER : each request triggers a transfer of a number of blocks
               with block size and number of blocks defined within the function HAL_MDMA_Start/HAL_MDMA_Start_IT.
             + MDMA_FULL_TRANSFER : each request triggers a full transfer 
              all blocks and all nodes(if a linked list hase been created using HAL_MDMA_CreateLinkedListNode\HAL_MDMA_ConnectLinkedListNode).

     *** Polling mode IO operation ***
     =================================   
    [..] 
          (+) Use HAL_MDMA_Start() to start MDMA transfer after the configuration of Source 
              address and destination address and the Length of data to be transferred.
          (+) Use HAL_MDMA_PollForTransfer() to poll for the end of current transfer or a transfer level
             In this case a fixed Timeout can be configured by User depending from his application.			 
		  (+) Use HAL_MDMA_Abort() function to abort the current transfer : blocking method this API returns  
              when the abort ends or timeout (should not be called from an interrupt service routine).
               
     *** Interrupt mode IO operation ***    
     =================================== 
    [..]     
          (+) Configure the MDMA interrupt priority using HAL_NVIC_SetPriority()
          (+) Enable the MDMA IRQ handler using HAL_NVIC_EnableIRQ() 
          (+) Use HAL_MDMA_Start_IT() to start MDMA transfer after the configuration of  
              Source address and destination address and the Length of data to be transferred. In this 
              case the MDMA interrupt is configured. 
          (+) Use HAL_MDMA_IRQHandler() called under MDMA_IRQHandler() Interrupt subroutine
          (+) At the end of data transfer HAL_MDMA_IRQHandler() function is executed and user can 
              add his own function by customization of function pointer XferCpltCallback and 
              XferErrorCallback (i.e a member of MDMA handle structure). 
              
          (+) Use HAL_MDMA_Abort_IT() function to abort the current transfer : non-blocking method. This API returns immediately
              then the callback XferAbortCallback (if specified  by the user) is asserted once the MDMA channel hase effectively aborted.
              (could be called from an interrupt service routine).
              
          (+) Use functions HAL_MDMA_RegisterCallback and HAL_MDMA_UnRegisterCallback respectevely to register unregister user callbacks
              from the following list :
              (++) XferCpltCallback            : transfer complete callback.
              (++) XferBufferCpltCallback      : buffer transfer complete callback.
              (++) XferBlockCpltCallback       : block transfer complete callback.
              (++) XferRepeatBlockCpltCallback : repeated block transfer complete callback.              
              (++) XferErrorCallback           : transfer error callback.      
              (++) XferAbortCallback           : transfer abort complete callback.    
              
