zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/src/stm32mp1xx_hal_mdma.c
  /* if block destination address offset is negative set the Block Repeat destination address Update Mode to decrement */
  if(pNodeConfig->Init.DestBlockAddressOffset < 0)
  {
    pNode->CBNDTR |= MDMA_CBNDTR_BRDUM;
    /*write new CBRUR Register value : destination repeat block offset */ 
    pNode->CBRUR |= (((uint32_t)(-1 * pNodeConfig->Init.DestBlockAddressOffset)) & 0x0000FFFFU) << POSITION_VAL(MDMA_CBRUR_DUV);          
  }
  else
  {
    /*write new CBRUR Register value : destination repeat block offset */     
    pNode->CBRUR |= (((uint32_t)pNodeConfig->Init.DestBlockAddressOffset) & 0x0000FFFFU) << POSITION_VAL(MDMA_CBRUR_DUV);    
  }    
  
  /* Configure MDMA Link Node data length */
  pNode->CBNDTR |=  pNodeConfig->BlockDataLength;
  
  /* Configure MDMA Link Node destination address */
  pNode->CDAR = pNodeConfig->DstAddress; 
  
  /* Configure MDMA Link Node Source address */
  pNode->CSAR = pNodeConfig->SrcAddress;
  
  /* if HW request set the HW request and the requet CleraMask and ClearData MaskData,  */
  if(pNodeConfig->Init.Request != MDMA_REQUEST_SW)
  {
    /* Set the HW request in CTBR register  */
    pNode->CTBR = pNodeConfig->Init.Request & MDMA_CTBR_TSEL;
    /* Set the HW request clear Mask and Data */
    pNode->CMAR = pNodeConfig->PostRequestMaskAddress;
    pNode->CMDR = pNodeConfig->PostRequestMaskData;      
  }
  
  addressMask = pNodeConfig->SrcAddress & 0xFF000000U;
  if((addressMask == 0x20000000U) || (addressMask == 0x00000000U))
  {
    /*The AHBSbus is used as source (read operation) on channel x */
    pNode->CTBR |= MDMA_CTBR_SBUS;  
  }
  
  addressMask = pNodeConfig->DstAddress & 0xFF000000U;
  if((addressMask == 0x20000000U) || (addressMask == 0x00000000U))
  {
    /*The AHB bus is used as destination (write operation) on channel x */
    pNode->CTBR |= MDMA_CTBR_DBUS;
  }
  
  return HAL_OK;
}

/**
  * @brief  Connect a node to the linked list
  *         parameters in the MDMA_InitTypeDef .
  * @param  hmdma    : pointer to a MDMA_HandleTypeDef structure that contains
  * @param  pNewNode : Pointer to a MDMA_LinkNodeTypeDef structure that contains Linked list node 
  *                    to be add to the list.
  * @param pPrevNode : Pointer to the new node position in the linked list or zero to insert the new node
  *                    at the end of the list 
  *
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MDMA_LinkedList_AddNode(MDMA_HandleTypeDef *hmdma, MDMA_LinkNodeTypeDef *pNewNode, MDMA_LinkNodeTypeDef *pPrevNode)
{
  MDMA_LinkNodeTypeDef *pNode = 0;
  uint32_t counter = 0, nodeConter = 0, nodeInserted = 0;
  HAL_StatusTypeDef hal_status = HAL_OK;  
  
  /* Check the MDMA peripheral handle */
  if((hmdma == NULL) || (pNewNode == NULL))
  {
    return HAL_ERROR;
  }  
  
  /* Process locked */
  __HAL_LOCK(hmdma);
  
  if(HAL_MDMA_STATE_READY == hmdma->State)
  {
    /* Change MDMA peripheral state */
    hmdma->State = HAL_MDMA_STATE_BUSY;
    
    /* Check if this is the first node (after the Inititlization node) */
    if((uint32_t)hmdma->FirstLinkedListNodeAddress == 0)
    {
      if(pPrevNode == NULL)
      {
        /* if this is the first node after the initialization  
        connect this node to the node 0 by updating
        the MDMA channel CLAR register to this node address */
        hmdma->Instance->CLAR = (uint32_t)pNewNode;
        /* Set the MDMA handle First linked List node*/
        hmdma->FirstLinkedListNodeAddress = pNewNode;
        
        /*reset New node link */
        pNewNode->CLAR = 0;
        
        /* Update the Handle last node address */      
        hmdma->LastLinkedListNodeAddress = pNewNode;
        
        hmdma->LinkedListNodeCounter = 1;
      }
      else
      {
        hal_status = HAL_ERROR;
      }
    }
    else if(((uint32_t)hmdma->LastLinkedListNodeAddress != 0) && (hmdma->LinkedListNodeCounter != 0))  
    {
      /* if new node is equal to first node then linked list is circular */
      if(hmdma->FirstLinkedListNodeAddress == pNewNode)
      {
        pNode = hmdma->FirstLinkedListNodeAddress;
        if(pPrevNode == 0)
        {
          pPrevNode = hmdma->LastLinkedListNodeAddress;
        }
        while((counter < hmdma->LinkedListNodeCounter) && (nodeInserted == 0))
        {
          if(pNode == pPrevNode)
          {
            pNode->CLAR = (uint32_t)pNewNode; 
            hmdma->LastLinkedListNodeAddress = pNode;
            nodeInserted = 1;
          }
          
          pNode = (MDMA_LinkNodeTypeDef *)pNode->CLAR;
          nodeConter++;
          counter ++;
        }
        if(nodeInserted ==  0)
        {
          hal_status = HAL_ERROR;
        }
        else
        {
          /* update linked lis counter */
          hmdma->LinkedListNodeCounter = nodeConter;
        }
      }
      else
      {
        /* Check if the node to insert already exists*/        
        pNode = hmdma->FirstLinkedListNodeAddress;
        while((counter < hmdma->LinkedListNodeCounter) && (hal_status == HAL_OK))
        {
          if(pNode->CLAR == (uint32_t)pNewNode)
          {
            hal_status = HAL_ERROR; /* error this node already exist in the linked list and it is not first node */
          }
          pNode = (MDMA_LinkNodeTypeDef *)pNode->CLAR;
          counter++;
        }
        
        if(hal_status == HAL_OK)
        {
          /* Check if the previous node is the last one in the current list or zero */     
          if((pPrevNode == hmdma->LastLinkedListNodeAddress) || (pPrevNode == 0))
          {
            /* insert the new node at the end of the list. */
            pNewNode->CLAR = hmdma->LastLinkedListNodeAddress->CLAR;            
            hmdma->LastLinkedListNodeAddress->CLAR = (uint32_t)pNewNode;
            /* Update the Handle last node address */
            hmdma->LastLinkedListNodeAddress = pNewNode;
            /* Increment the linked list node counter */
            hmdma->LinkedListNodeCounter++;
          }
          else
          {
            /*insert the new node after the pPreviousNode node */ 
            pNode = hmdma->FirstLinkedListNodeAddress;
            counter = 0;
            while((counter < hmdma->LinkedListNodeCounter) && (nodeInserted == 0))
            {
              counter++;
              if(pNode == pPrevNode)
              {
                /*Insert the new node after the previous one */
                pNewNode->CLAR = pNode->CLAR;
                pNode->CLAR = (uint32_t)pNewNode; 
                /* Increment the linked list node counter */
                hmdma->LinkedListNodeCounter++;
                nodeInserted = 1;
              }
              else
              {
                pNode = (MDMA_LinkNodeTypeDef *)pNode->CLAR;
              }
            }
            
            if(nodeInserted == 0)
            {
              hal_status = HAL_ERROR;
            }
          }
        }
      }      
    }
    else
    {
      hal_status = HAL_ERROR;     
    }
    
