zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/src/stm32mp1xx_hal_mdma.c
  addressMask = DstAddress & 0xFF000000U;
  if((addressMask == 0x20000000U) || (addressMask == 0x00000000U))
  {
    /*The AHB bus is used as destination (write operation) on channel x */
    hmdma->Instance->CTBR |= MDMA_CTBR_DBUS;
  }
  else
  {
    /*The AXI bus is used as destination (write operation) on channel x */
    hmdma->Instance->CTBR &= (~MDMA_CTBR_DBUS);  
  }
  
  /* Set the linked list rgeitser to the first node of the list */
  hmdma->Instance->CLAR = (uint32_t)hmdma->FirstLinkedListNodeAddress;  
}

static void MDMA_Init(MDMA_HandleTypeDef *hmdma)
{
  /* Prepare the MDMA Channel configuration */
  hmdma->Instance->CCR = hmdma->Init.Priority  | hmdma->Init.SecureMode | hmdma->Init.Endianess;
  
  /* write new CTCR Register value */
  hmdma->Instance->CTCR =  hmdma->Init.SourceInc      | hmdma->Init.DestinationInc  | \
                   hmdma->Init.SourceDataSize | hmdma->Init.DestDataSize  | \
                   hmdma->Init.DataAlignment  | hmdma->Init.SourceBurst   | \
                   hmdma->Init.DestBurst      | \
                   ((hmdma->Init.BufferTransferLength - 1) << POSITION_VAL(MDMA_CTCR_TLEN)) | \
                   hmdma->Init.TransferTriggerMode;
  
  /* If SW request set the CTCR register to SW Request Mode*/
  if(hmdma->Init.Request == MDMA_REQUEST_SW)
  {
    hmdma->Instance->CTCR |= MDMA_CTCR_SWRM;
  }
  
  /* Reset CBNDTR Register */ 
  hmdma->Instance->CBNDTR = 0;
  
  /* if block source address offset is negative set the Block Repeat Source address Update Mode to decrement */
  if(hmdma->Init.SourceBlockAddressOffset < 0)
  {
    hmdma->Instance->CBNDTR |= MDMA_CBNDTR_BRSUM;
    /*write new CBRUR Register value : source repeat block offset */ 
    hmdma->Instance->CBRUR = (((uint32_t)(-1 * hmdma->Init.SourceBlockAddressOffset)) & 0x0000FFFFU);
  }
  else
  {
    /*write new CBRUR Register value : source repeat block offset */     
    hmdma->Instance->CBRUR = (((uint32_t)hmdma->Init.SourceBlockAddressOffset) & 0x0000FFFFU);    
  }
  
  /* if block destination address offset is negative set the Block Repeat destination address Update Mode to decrement */
  if(hmdma->Init.DestBlockAddressOffset < 0)
  {
    hmdma->Instance->CBNDTR |= MDMA_CBNDTR_BRDUM;
    /*write new CBRUR Register value : destination repeat block offset */ 
    hmdma->Instance->CBRUR |= (((uint32_t)(-1 * hmdma->Init.DestBlockAddressOffset)) & 0x0000FFFFU) << POSITION_VAL(MDMA_CBRUR_DUV);    
  }
  else
  {
    /*write new CBRUR Register value : destination repeat block offset */     
    hmdma->Instance->CBRUR |= (((uint32_t)hmdma->Init.DestBlockAddressOffset) & 0x0000FFFFU) << POSITION_VAL(MDMA_CBRUR_DUV);    
  }   
  
  /* if HW request set the HW request and the requet CleraMask and ClearData MaskData,  */
  if(hmdma->Init.Request != MDMA_REQUEST_SW)
  {
    /* Set the HW request in CTRB register  */
    hmdma->Instance->CTBR = hmdma->Init.Request & MDMA_CTBR_TSEL;      
  }
  else /* SW request : reset the CTBR register */
  {
    hmdma->Instance->CTBR = 0;
  }
  
  /*Write Link Address Register*/
  hmdma->Instance->CLAR =  0;
}


/**
  * @brief MDMA MSP Init
  * @param hmdma: MDMA handle
  * @retval None
  */
 __weak void HAL_MDMA_MspInit(MDMA_HandleTypeDef *hmdma)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_MDMA_MspInit can be implemented in the user file
   */
}

/**
  * @brief MDMA MSP DeInit
  * @param hmdma: MDMA handle
  * @retval None
  */
 __weak void HAL_MDMA_MspDeInit(MDMA_HandleTypeDef *hmdma)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_MDMA_MspDeInit can be implemented in the user file
   */
}

/**
  * @}
  */

#endif /* HAL_MDMA_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
